# IndexLine Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexLine Members
IndexLine Class Constructors Methods Properties See Also
---
The IndexLine type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IndexLine | Constructs the line segment primitive. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from IndexPrimitive.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Index0 | The index of the line segment's first vertex. |
| Index1 | The index of the line segment's second vertex. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from IndexPrimitive.) |

# See Also
IndexLine Class
Autodesk.Revit.DB.DirectContext3D Namespace